# SetItalicStatus Method (Boolean)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..SetItalicStatus Method (Boolean)
FormattedText Class See Also
---
Sets the characters in the entire text to be italic or not italic.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetItalicStatus(
	bool isItalic
)
```

Visual Basic
---
```text
Public Sub SetItalicStatus ( _
	isItalic As Boolean _
)
```

Visual C++
---
```text
public:
void SetItalicStatus(
	bool isItalic
)
```

# ### Parameters
isItalic
    Type: System..::..Boolean The desired italic status of characters in the entire text. True to set italic, false to set not italic.
# See Also
FormattedText Class
SetItalicStatus Overload
Autodesk.Revit.DB Namespace